MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_NPX.h
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_SHIFT (0U)
/*! MASKEDKEY1WORD1 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_SHIFT)) & NPX_MRMASKEDKEYWORD1_MASKEDKEY1WORD1_MASK)

#define NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_SHIFT (0U)
/*! MASKEDKEY2WORD1 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_SHIFT)) & NPX_MRMASKEDKEYWORD1_MASKEDKEY2WORD1_MASK)

#define NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_SHIFT (0U)
/*! MASKEDKEY3WORD1 - Masked Key Word 1 */
#define NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_SHIFT)) & NPX_MRMASKEDKEYWORD1_MASKEDKEY3WORD1_MASK)
/*! @} */

/* The count of NPX_MRMASKEDKEYWORD1 */
#define NPX_MRMASKEDKEYWORD1_COUNT               (4U)

/*! @name MRMASKEDKEYWORD2 - Memory Region 0, Masked Key Word 2..Memory Region 3, Masked Key Word 2 */
/*! @{ */

#define NPX_MRMASKEDKEYWORD2_MASKEDKEY0WORD2_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY0WORD2_SHIFT (0U)
/*! MASKEDKEY0WORD2 - Masked Key Word 2 */
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY0WORD2(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD2_MASKEDKEY0WORD2_SHIFT)) & NPX_MRMASKEDKEYWORD2_MASKEDKEY0WORD2_MASK)

#define NPX_MRMASKEDKEYWORD2_MASKEDKEY1WORD2_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY1WORD2_SHIFT (0U)
/*! MASKEDKEY1WORD2 - Masked Key Word 2 */
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY1WORD2(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD2_MASKEDKEY1WORD2_SHIFT)) & NPX_MRMASKEDKEYWORD2_MASKEDKEY1WORD2_MASK)

#define NPX_MRMASKEDKEYWORD2_MASKEDKEY2WORD2_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY2WORD2_SHIFT (0U)
/*! MASKEDKEY2WORD2 - Masked Key Word 2 */
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY2WORD2(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD2_MASKEDKEY2WORD2_SHIFT)) & NPX_MRMASKEDKEYWORD2_MASKEDKEY2WORD2_MASK)

#define NPX_MRMASKEDKEYWORD2_MASKEDKEY3WORD2_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY3WORD2_SHIFT (0U)
/*! MASKEDKEY3WORD2 - Masked Key Word 2 */
#define NPX_MRMASKEDKEYWORD2_MASKEDKEY3WORD2(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD2_MASKEDKEY3WORD2_SHIFT)) & NPX_MRMASKEDKEYWORD2_MASKEDKEY3WORD2_MASK)
/*! @} */

/* The count of NPX_MRMASKEDKEYWORD2 */
#define NPX_MRMASKEDKEYWORD2_COUNT               (4U)

/*! @name MRMASKEDKEYWORD3 - Memory Region 0, Masked Key Word 3..Memory Region 3, Masked Key Word 3 */
/*! @{ */

#define NPX_MRMASKEDKEYWORD3_MASKEDKEY0WORD3_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY0WORD3_SHIFT (0U)
/*! MASKEDKEY0WORD3 - Masked Key Word 3 */
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY0WORD3(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD3_MASKEDKEY0WORD3_SHIFT)) & NPX_MRMASKEDKEYWORD3_MASKEDKEY0WORD3_MASK)

#define NPX_MRMASKEDKEYWORD3_MASKEDKEY1WORD3_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY1WORD3_SHIFT (0U)
/*! MASKEDKEY1WORD3 - Masked Key Word 3 */
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY1WORD3(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD3_MASKEDKEY1WORD3_SHIFT)) & NPX_MRMASKEDKEYWORD3_MASKEDKEY1WORD3_MASK)

#define NPX_MRMASKEDKEYWORD3_MASKEDKEY2WORD3_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY2WORD3_SHIFT (0U)
/*! MASKEDKEY2WORD3 - Masked Key Word 3 */
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY2WORD3(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD3_MASKEDKEY2WORD3_SHIFT)) & NPX_MRMASKEDKEYWORD3_MASKEDKEY2WORD3_MASK)

#define NPX_MRMASKEDKEYWORD3_MASKEDKEY3WORD3_MASK (0xFFFFFFFFU)
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY3WORD3_SHIFT (0U)
/*! MASKEDKEY3WORD3 - Masked Key Word 3 */
#define NPX_MRMASKEDKEYWORD3_MASKEDKEY3WORD3(x)  (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKEDKEYWORD3_MASKEDKEY3WORD3_SHIFT)) & NPX_MRMASKEDKEYWORD3_MASKEDKEY3WORD3_MASK)
/*! @} */

/* The count of NPX_MRMASKEDKEYWORD3 */
#define NPX_MRMASKEDKEYWORD3_COUNT               (4U)

/*! @name MRMASKFORKEYWORD0 - Memory Region 0, Mask for Key Word 0..Memory Region 3, Mask for Key Word 0 */
/*! @{ */

#define NPX_MRMASKFORKEYWORD0_MASK0WORD0_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD0_MASK0WORD0_SHIFT   (0U)
/*! MASK0WORD0 - Mask for Key Word 0 */
#define NPX_MRMASKFORKEYWORD0_MASK0WORD0(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD0_MASK0WORD0_SHIFT)) & NPX_MRMASKFORKEYWORD0_MASK0WORD0_MASK)

#define NPX_MRMASKFORKEYWORD0_MASK1WORD0_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD0_MASK1WORD0_SHIFT   (0U)
/*! MASK1WORD0 - Mask for Key Word 0 */
#define NPX_MRMASKFORKEYWORD0_MASK1WORD0(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD0_MASK1WORD0_SHIFT)) & NPX_MRMASKFORKEYWORD0_MASK1WORD0_MASK)

#define NPX_MRMASKFORKEYWORD0_MASK2WORD0_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD0_MASK2WORD0_SHIFT   (0U)
/*! MASK2WORD0 - Mask for Key Word 0 */
#define NPX_MRMASKFORKEYWORD0_MASK2WORD0(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD0_MASK2WORD0_SHIFT)) & NPX_MRMASKFORKEYWORD0_MASK2WORD0_MASK)

#define NPX_MRMASKFORKEYWORD0_MASK3WORD0_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD0_MASK3WORD0_SHIFT   (0U)
/*! MASK3WORD0 - Mask for Key Word 0 */
#define NPX_MRMASKFORKEYWORD0_MASK3WORD0(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD0_MASK3WORD0_SHIFT)) & NPX_MRMASKFORKEYWORD0_MASK3WORD0_MASK)
/*! @} */

/* The count of NPX_MRMASKFORKEYWORD0 */
#define NPX_MRMASKFORKEYWORD0_COUNT              (4U)

/*! @name MRMASKFORKEYWORD1 - Memory Region 0, Mask for Key Word 1..Memory Region 3, Mask for Key Word 1 */
/*! @{ */

#define NPX_MRMASKFORKEYWORD1_MASK0WORD1_MASK    (0xFFFFFFFFU)
#define NPX_MRMASKFORKEYWORD1_MASK0WORD1_SHIFT   (0U)
/*! MASK0WORD1 - Mask for Key Word 1 */
#define NPX_MRMASKFORKEYWORD1_MASK0WORD1(x)      (((uint32_t)(((uint32_t)(x)) << NPX_MRMASKFORKEYWORD1_MASK0WORD1_SHIFT)) & NPX_MRMASKFORKEYWORD1_MASK0WORD1_MASK)

